{
  "filename": "30th_BWC_Minutes.txt",
  "content": "Room of NIT Transit House, Kunjaban, Agartala, Tripura\n\n**Minutes of the 30th Building & Works Committee Meeting**\nDecember 09, 2013, NIT Agartala\n\nNATIONAL INSTITUTE OF TECHNOLOGY, AGARTALA\nBarjala, Jirania, West Tripura – 799055\n\nThe 30th meeting of the Building & Works Committee of National Institute of Technology, Agartala was held on December 09, 2013 (Monday) at 6:30 pm in the Conference Room.\n\nProf. (Dr.) Subhash Ch. Saha, Director (I/C) and Chairman of the Building & Works Committee (B&WC), NIT, Agartala, presided over the meeting.\n\nThe following members were present:\n\nProf. (Dr.) Subhash Ch. Saha, Director (I/C), NIT, Agartala - Chairman, B&WC, NIT, Agartala\n\nSri Rajesh Singh, Director (NITs), Representative of MHRD - Member\n\nSri Asit Bhaumik, Addl. Chief Engineer / Representative of PWD (Civil), Govt. of Tripura - Member\n\nSri Kajal Banik, Executive Engineer (Elect.), Electrical Inspectorate/ Representative of PWD, Govt. of Tripura - Member\n\nDr. Ajoy Kr. Chakraborty, Dean (P & D), NIT Agartala - Member\n\nDr. R.P. Sharma, Professor, Civil Engg. Department, NIT Agartala - Member\n\nMr. Sumanta Chakraborty, Registrar (I/C), NIT, Agartala - Member Secretary\n\nDr. S.K. Paul, Advisor to the Director, NIT Agartala - Invitee\n\nThe Chairman welcomed all the members present in the meeting and requested the Registrar (I/C) and Dean (P&D) to initiate Agenda-wise discussions.\n\n**Item No. 30.1:** Confirmation of the Minutes of the 29th Building & Works Committee Meeting held on June 17, 2013.\n\nThe minutes of the 29th Building & Works Committee Meeting held on June 17, 2013, in the Conference Room of NIT Agartala were circulated to all the members and no modifications/suggestions/comments were received. The minutes of the 29th Building & Works Committee of NIT Agartala were confirmed.\n\n**Item No. 30.2:** Action taken on the decision of the 29th Building & Works Committee Meeting held on June 17, 2013, in the Conference Room of NIT Agartala.\n\nThe Building & Works Committee opined that, in respect of Item No. 29.11 (Sl. No. 9), the lift for the Director's Bungalow need not be installed at present and may be deleted from the estimate. The action taken on other items was noted.\n\n**Item No. 30.3:** To Consider award of the work “Electrical Installation in the Computer Laboratory for Bio-Engineering Department [2nd Floor of Academic Building (DoNER Building)] at NIT Agartala”, at a cost of Rs. 1,43,283.00.\n\nThe Building & Works Committee approved the proposal for award of work at a cost of Rs. 1,43,283.00 to M/S Shree Guru Enterprise, Agartala.\n\n**Item No. 30.4:** To Consider award of the work “Electrical Installation in the Computer Laboratory for Chemical Engineering Department [2nd Floor of Academic Building (DoNER Building)] at NIT Agartala”, at a cost of Rs. 1,44,427.00.\n\nThe Building & Works Committee approved the proposal for award of work at a cost of Rs. 1,44,427.00 to M/S Satyanarayan Enterprise, Agartala.\n\n**Item No. 30.5:** To Consider award of the work “Electrical Installation in the Environment Lab & Mass Transfer Lab for Chemical Engineering Department (Workshop Building) at NIT Agartala”, at a cost of Rs. 85,820.00.\n\nThe Building & Works Committee approved the proposal for award of work at a cost of Rs. 85,820.00 to Shri Bimal Chakraborty, Udaipur.\n\n**Item No. 30.6:** To Consider award of the work “Electrical Installation in the 1st floor of extension of Estate Section at NIT Agartala”, at a cost of Rs. 86,404.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 86,404.00 and decided to award the work by inviting open tender.\n\n**Item No. 30.7:** To Consider the Estimate for the work “Electrical Installation in the Ground & First floor of CRF Building at NIT Agartala”, at a cost of Rs. 8,51,707.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 8,51,707.00 and decided to award the work by inviting open tender.\n\n**Item No. 30.8:** To Consider the Estimate for the work “Electrical Installation in the Physics Laboratory at Ground floor of DoNER Building at NIT Agartala”, at a cost of Rs. 6,00,195.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 6,00,195.00 and decided to award the work by inviting open tender.\n\n**Item No. 30.9:** To Consider the offer of AMC of M/s Rai Power for “Periodical Servicing & Maintenance of ‘Volvo Penta’ brand 2 (two) nos. 500 KVA DG Sets installed at NIT Agartala”, at a cost of Rs. 2,47,192.00.\n\nThe Building & Works Committee approved the proposal for award of work at a cost of Rs. 2,47,192.00 to M/s Rai Power, Kolkata.\n\n**Item No. 30.10:** To consider the estimate for the work “Supply, installation, testing & commissioning of electrical distribution system, sub-stations, D.G. Sets, and external electrical installations at NIT Agartala” at a cost of Rs. 8,01,51,762.00.\n\nThe Building & Works Committee opined that a technical scrutiny committee consisting of the Estate Engineer, one member from Electrical Engineering Department, and one member from TSECL in the rank of DGM should be formed for vetting the estimate and DNIT of the proposed work.\n\n**Item No. 30.11:** To Consider acceptance of a single bid for “Supply of Tools & Machineries for Maintenance staff at NIT Agartala”, at a cost of Rs. 1,92,015.00.\n\nThe Building & Works Committee approved the proposal for calling a fresh tender with a revised estimate.\n\n**Item No. 30.12:** To Consider award of work “Supply, installation, testing and commissioning of External lighting of International Guest House at NIT Agartala” at a cost of Rs. 6,39,066.00.\n\nThe Building & Works Committee approved the proposal for award of work at a cost of Rs. 6,39,066.00 to M/S Multi Traders, Agartala.\n\n**Item No. 30.13:** To consider extra items in the work under the agreement for “Construction of Administrative Block-I & II and Seminar Hall at NIT, Agartala” at a cost of Rs. 34,35,595.00.\n\nThe Building & Works Committee opined that the proposal may be resubmitted with proper justification. The consultant is to submit the justification for the extra items and deviated quantities of work. The external items should be deleted.\n\n**Item No. 30.14:** To Consider the Estimate for the work “Construction of 2 x 1 MVA 11/0.4KV Substation with overhead line and cable for Supply of power to the Computer Centre Building”, at a cost of Rs. 42,85,329.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 42,85,329.00 and decided to award the work by inviting open tender.\n\n**Item No. 30.15:** To consider the extra items for the works “Construction of Sewerage Treatment Plant 75KLD at NIT Agartala” and “Construction of Sewerage Treatment Plant 150KLD at NIT Agartala”, at a cost of Rs. 83,200.00 for 75 KLD and Rs. 1,00,002.00 for 150KLD respectively.\n\nThe Building & Works Committee approved the proposal for award of extra items of works at a cost of Rs. 83,200.00 for 75KLD and Rs. 1,00,002.00 for 150KLD Sewerage Treatment Plant respectively to M/S Clear Ion Experts Pvt. Ltd., Faridabad.\n\n**Item No. 30.16:** To consider the estimate for the work “Construction of concrete pavement road at H4A Building at NIT Agartala”, at a cost of Rs. 5,50,800.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 5,50,800.00 and decided to award the work by inviting open tender.\n\n**Item No. 30.17:** To consider award of the work “Construction of Additional floor of Market Complex at NIT Agartala” to R.D. Department as deposit work.\n\nThe Building & Works Committee suggested placing the proposal with a detailed estimate in the next BWC meeting.\n\n**Item No. 30.18:** To consider the extra item & deviation for the work “Improvement of Road from Administrative Block-1 through the backside of workshop no-1 to Auxiliary Gate-3 Near Sports Complex via Girls Hostel/ S/H: - Providing metalling, carpeting, widening, and construction of roadside drain”, at a cost of Rs. 9,50,073.00.\n\nThe Building & Works Committee opined that the proposal may be placed with proper justification after being scrutinized by the Institute Technical Scrutiny Committee.\n\n**Item No. 30.19:** To consider the estimate for the work “Partition wall at CRF Building at NIT Agartala”, at a cost of Rs. 21,89,405.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 21,89,405.00 and decided to award the works by inviting open tender.\n\n**Item No. 30.20:** To consider the estimate for the work “Construction of Partition wall, water supply arrangement with provision of basin etc. in the ground floor of New DoNER Building for Physics Laboratories in Room No. 102, 105 to 108 at NIT Agartala”, at a cost of Rs. 6,29,981.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 6,29,981.00 and decided to award the works by inviting open tender.\n\n**Item No. 30.21:** To consider award of the following works as deposit work to CPWD.\n\n| Sl. No. | Name of Work                                                                                                                                | Estimated Cost             |\n| ------- | -------------------------------------------------------------------------------------------------------------------------------------------- | -------------------------- |\n| 1       | Construction of Central School Building at NIT Agartala/ S.H.: Development of School Ground by earth filling                                | ₹86,97,619.00 (including 45% cost index on DSR-2012 and 3% contingencies) |\n| 2       | Construction of Internal Road to Newly Constructed Central School (KV) Building at NIT Agartala                                            | ₹90,48,922.00 (including 45% cost index on DSR-2012 and 3% contingencies) |\n| 3       | Construction of Approach Road (95 Mtr. Long) to Police out post and Security Barak at NIT Agartala                                       | ₹12,66,919.00 (including 45% cost Index on DSR-2012 and 3% contingencies) |\n| 4       | Construction of Approach Road to H3A & H3B Building by providing Paver Block at NIT Agartala                                              | ₹7,95,268.00 (including 45% cost index on DSR-2012 and 3% contingencies)  |\n| 5       | Providing a connecting corridor in between dining and main building of Boys Hostel (Aryabhatta)                                              | ₹8,69,820.00 (including 45% cost index on DSR-2012 and 3% contingencies)  |\n| 6       | Modification of Corridor in the Girls Hostel (Gargi) providing fiber glass shutter with aluminium frames in the openings and 3% contingencies | ₹22,19,015.00 (including 45% cost index on DSR-2012, 0% on analysis of rate |\n\nThe Building & Works Committee approved the proposals.\n\n**Item No. 30.22:** To consider the estimate for the work “Providing Cladding on outer walls of lift wells in Phase-II Housing Complex at H3A, H3B, H4A, H4B & H5 NIT Agartala”, at a cost of Rs. 10,52,350.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 10,52,350.00 to award the work to M/S NCC Limited as a deviation of the Phase-II agreement.\n\n**Item No. 30.23:** To consider the estimate for the work “Boring of 2 nos. 150mm dia tube well with 5HP submersible pump in School of Management Building at NIT Agartala”, at a cost of Rs. 8,89,853.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 8,89,853.00 and decided to award the works by inviting open tender by clubbing together Item No. 30.24.\n\n**Item No. 30.24:** To consider the estimate for the work “Boring of 2 nos. 150mm dia tube well with 5HP Submersible pump for Admin Block-I & II and Seminar Hall at NIT Agartala”, at a cost of Rs. 8,89,853.00.\n\nThe Building & Works Committee approved the proposal with an estimated cost of Rs. 8,89,853.00 and decided to award the works by inviting open tender by clubbing together Item No. 30.23.\n\n**Item No. 30.25:** To consider various construction activities already approved by the Director, for ratification by the BWC.\n\nThe Building & Works Committee ratified the items.\n\n**Item No. 30. 26:** To consider the extra item, at a cost of Rs. 96,935.00, for the work “Construction of Academic Building 2nd and 3rd floor at NIT Agartala” (DoNER).\n\nThe Building & Works Committee opined that the proposal may be placed with proper justification after being scrutinized by the Institute Technical Scrutiny Committee.\n\n**Item No. 30.27:** To consider the total tentative deviation (including extra items) in the work of “Construction of Administrative Blocks- I & II and Seminar Hall at NIT Agartala” at a cost of Rs. 4,17,77,225.00.\n\nThe Building & Works Committee opined that the proposal may be submitted after obtaining necessary justification from the Consultant. The Building & Works Committee also suggested that one Institute Technical Scrutiny Committee is to be formed with four faculty members from the Civil Engineering Department and three faculty members from the Electrical Engineering Department. This committee will check and recommend the deviation including extra items, substitute items etc. in totality. The Estate Engineering Section will assist the Committee.\n\n**Item No. 30.28:** To consider the total tentative deviation (including extra and substituted items) in the work of “Construction of School of Management Building at NIT Agartala” at a cost of Rs. 1,19,98,165.00.\n\nThe Building & Works Committee opined that the proposal may be submitted after obtaining necessary justification from the Consultant. The Building & Works Committee also suggested that one Institute Technical Scrutiny Committee is to be formed with four faculty members from the Civil Engineering Department and three faculty members from the Electrical Engineering Department. This committee will check and recommend the deviation including extra items, substitute items etc. in totality. The Estate Engineering Section will assist the Committee.\n\n**Item No. 30.29:** To consider the total tentative deviation (including extra items) in the work of “Construction of Housing, Guest House, Director’s Residence, Including internal water supply, sanitary Installations, Drainage, Fire Suppression & Internal Electrical works at NIT Agartala”, at a cost of Rs. 4,93,47,509.00.\n\nThe Building & Works Committee opined that the proposal may be submitted after obtaining necessary justification from the Consultant. The Building & Works Committee also suggested that one Institute Technical Scrutiny Committee is to be formed with four faculty members from the Civil Engineering Department and three faculty members from the Electrical Engineering Department. This committee will check and recommend the deviation including extra items, substitute items etc. in totality. The Estate Engineering Section will assist the Committee.\n\n**Item No. 30.30:** To consider the estimate for the work “Water Supply & Sanitary installation in the 40-men capacity Security Barak at NIT Agartala”, at a cost of Rs. 5,62,025.00.\n\nThe Building & Works Committee also suggested that one Institute Technical Scrutiny Committee is to be formed with four faculty members from the Civil Engineering Department and three faculty members from the Electrical Engineering Department for vetting the estimate.\n\n**Item No. 30.31:** To consider the substitute item and deviation for the work “Providing and fixing MS Grill and False Ceiling in School of Management at NIT Agartala”.\n\nThe Building & Works Committee approved the proposal at a cost of Rs. 12,23,468.00 with the condition that the requisition from the Department should be placed on record.\n\n**Item No. 30.32:** Any other item with the permission of the Chair.\n\n**Item No. 30.32.1:** To consider the estimate for the work “Special repair of Gomati Hostel during the year 2013-14 at NIT Agartala”, at a cost of Rs. 50,21,082.00.\n\nDue to the sad demise of Sri Rahul Kumar, a 2nd-year student of ECE Department, who was residing in Gomati Hostel, a total student unrest took place at the NIT Agartala campus from December 04, 2013, onwards. Students gheraoed the administration and demanded the immediate renovation of all three old Hostels viz. Gomati, Dhalai, and Howrah Hostels at par with the new Hostel (Aryabhatta) within a month's time. The District Administration also intervened in this matter and advised the Institute authority to accept one of the demands to renovate all three old Hostels namely Gomati, Dhalai, and Howrah within this time. The decision of the renovation of three old hostels viz. Gomati, Dhalai, and Howrah was taken in presence of the District Magistrate, Superintendent of Police, and other state government Officials to subside the agitation of the students.\n\nThe BWC members discussed in detail the prevailing situation of student unrest and the commitment given by the Institute authority and District Administration. The BWC also decided to give the work to M/s NCCL, a resourceful Contractor who has been working on other construction works of the NIT Agartala campus and has the potential to complete the work within the time frame as mentioned above.\n\nConsidering the emergent situation, the BWC approved the execution of the works by M/S NCCL as extra items / deviated quantities of works on the agreement of Administrative Block I & II and Seminar Hall at NIT Agartala, with the following conditions at Gomati Hostel only as an exceptional case:\n\n1.  Execution of items in the estimate at the rates covered in the existing agreement (Rs. 39,32,218/-)\n2.  For other items, the rates may be finalized by giving a percentage above the schedule rate as per the existing agreement (Rs. 10,11,367/-)\n3.  Items not borne on the schedule may be executed on the basis of market rate analysis (Nil)\n\nThe Estate Engineering Section prepared the revised estimate as per the advice and the guidelines of the BWC which comes to Rs. 49,45,585.00. The Building & Works Committee approved the proposal at a cost of Rs. 49,45,585.00.\n\n**Item No. 30.32.2:** To consider the estimate for the work “Special repair of Dhalai Hostel during the year 2013-14 at NIT Agartala”, at a cost of Rs. 34,71,336.00.\n\nRegarding this and other old Hostels, the BWC opined that similar works may be carried out by inviting tender on short notice.\n\nThe BWC advised constituting an Institute Technical Scrutiny Committee to check Planning, Design, Estimate, and also Vetting of all Construction Works.\n\nMr. Rajesh Singh, Director (NITs), MHRD proposed to include one member from CPWD in the Building and Works Committee.\n\nThe meeting ended with a vote of thanks to the chair.\n\n(Mr. Sumanta Chakraborty)\nRegistrar (I/C) and Member Secretary\nBuilding & Works Committee\nNational Institute of Technology, Agartala\n\n(Prof. (Dr.) Subhash Ch. Saha)\nDirector (I/C) and Chairman\nBuilding & Works Committee\nNational Institute of Technology, Agartala\n",
  "source_url": "https://nita.ac.in/Minutes_Others/BWC_Minutes/30th_BWC_Minutes.pdf"
}