{
  "filename": "AdmitCard_MidTerm_Feb2025.txt",
  "content": {
    "institute": "National Institute of Technology Agartala",
    "address": "Barjala, Jirania, Agartala – 799046 (Tripura)",
    "office": "Office of the Dean Academic & Examinations",
    "email": "exam.nitagartala@gmail.com",
    "reference_no": "No. F.NITA.6(1-Exam)/NOTICE/2016-17",
    "date": "24th February 2025",
    "notice": "This is to inform all the students of UG, DUAL, PG & BSc BEd appearing for the Mid Term Even Semester Examination scheduled from 28th February 2025, that the Admit Card for the said Examination can be printed from their respective MIS Accounts as per the scheduled dates mentioned below.",
    "exam_details": [
      {
        "sl_no": 1,
        "exam_name": "Mid Term Even Semester Examination (UG, DUAL, PG & BSc, BEd.)",
        "exam_starting_date": "28th February 2025",
        "admit_card_download_duration": "25th February 2025 to 27th February 2025"
      }
    ],
    "instructions": [
      "No students will be able to take the print out of their Admit Card before or after the above mentioned schedule.",
      "All the students are hereby instructed to bring the same admit card to the Examination Hall while appearing for the examination and take the endorsement from the invigilator at the designated place.",
      "Any student who fails to bring the admit card each day of the examination to the Exam Hall will be required to bring a duplicate admit card for the remaining days, which can also be downloaded from their respective MIS Account against a fine of Rs. 200/-.",
      "Students without their respective admit cards will be debarred from appearing in the Examinations."
    ],
    "signatory": {
      "name": "Associate Dean (Examinations)"
    },
    "copy_to": [
      "Dean (Academics) for kind information.",
      "All HoDs for kind information and necessary action please.",
      "MIS In-Charge for kind information and necessary action please.",
      "The System Administrator, NIT Agartala. He is requested to upload the Notification on the Institute Website.",
      "Guard file for record."
    ]
  },
  "source_url": "https://nita.ac.in/Student_Notifications/Examination/AdmitCard_MidTerm_Feb2025.pdf"
}
