{
  "filename": "AdmitCard_MidTerm_Aug24.txt",
  "content": {
    "institute": "National Institute of Technology Agartala",
    "address": "Barjala, Jirania, Agartala – 799046 (Tripura)",
    "office": "Office of the Dean Academic & Examinations",
    "reference_no": "No.F.NITA.6(1- Exam)/NOTICE/ 2016-17",
    "date": "23rd August 2024",
    "notice": "This is to inform all UG, Dual Degree, and PG students of both NITA and IITA (Intermediate Semesters) appearing for the Odd Semester Mid Term Examination scheduled from 30th August 2024, that the Admit Cards for the said Examination can be printed from their respective MIS Accounts as per the schedule mentioned below.",
    "exam_details": [
      {
        "sl_no": 1,
        "exam_name": "Odd Semester Mid Term Examination of UG, Dual Degree and PG Students (Intermediate Semesters)",
        "exam_starting_date": "30th August 2024",
        "admit_card_download_duration": "27th August 2024 to 29th August 2024"
      }
    ],
    "instructions": [
      "No student will be able to print their Admit Card before or after the above-mentioned schedule.",
      "All students are hereby instructed to bring their Admit Card to the Examination Hall while appearing for the examination and obtain endorsement from the invigilator at the designated place.",
      "Any student who fails to bring their Admit Card to the Exam Hall on any day of the examination will be required to download a Duplicate Admit Card from their respective MIS account against a fine of Rs. 200/- for the remaining days.",
      "Students without their respective Admit Cards will be debarred from appearing in the Examinations."
    ],
    "signatory": {
      "name": "Associate Dean (Examinations)"
    },
    "copy_to": [
      "Dean (Academics) for kind information.",
      "All HoDs for kind information and necessary action.",
      "MIS-In-Charge for information and necessary arrangements.",
      "The System Administrator, NIT Agartala, with a request to upload the Notification on the Institute Website.",
      "Guard file for record."
    ]
  },
  "source_url": "https://nita.ac.in/Student_Notifications/Examination/AdmitCard_MidTerm_Aug24.pdf"
}
