{
  "filename": "AdmitCard_End_Nov2024.txt",
  "content": {
    "institute": "National Institute of Technology Agartala",
    "address": "Barjala, Jirania, Agartala – 799046 (Tripura)",
    "office": "Office of the Dean Academic & Examinations",
    "reference_no": "No.F.NITA.6(1-Exam)/NOTICE/2016-17",
    "date": "07th November 2024",
    "notice": "This is to inform all UG, DUAL DEGREE, PG, and B.Sc-B.Ed students appearing for the End Term Odd Semester Examination 2024 scheduled from 22nd November 2024, that the Admit Card for the said Examination can be printed from their respective MIS Accounts as per the schedule mentioned below.",
    "exam_details": [
      {
        "sl_no": 1,
        "exam_name": "End Term Odd Semester Examination",
        "exam_starting_date": "22nd November 2024",
        "admit_card_download_duration": "19th November to 21st November 2024"
      }
    ],
    "instructions": [
      "No students will be able to take the print out of their Admit Card before or after the above-mentioned schedule.",
      "All students are hereby instructed to bring the same admit card to the Examination Hall while appearing for the examination and obtain endorsement from the invigilator at the designated place.",
      "Any student who fails to bring the admit card each day of the examination to the Exam Hall will be required to download a duplicate admit card from their respective MIS Account against a fine of Rs. 200/- for the remaining days of the examination.",
      "In case of any difficulties, please contact the MIS Section (Main Building – Room 106).",
      "Students without their respective admit cards will be debarred from appearing in the Examinations."
    ],
    "signatory": {
      "name": "Associate Dean (Examinations)"
    },
    "copy_to": [
      "Dean (Academics) for kind information.",
      "All HoDs for kind information and necessary action please.",
      "MIS In-Charge for kind information and necessary action please.",
      "The System Administrator, NIT Agartala. He is requested to upload the Notification on the Institute Website.",
      "Guard file for record."
    ],
    "contact": {
      "phone": "0381-2346630, 2348537",
      "fax": "0381-2346360",
      "website": "www.nita.ac.in"
    }
  },
  "source_url": "https://nita.ac.in/Student_Notifications/Examination/AdmitCard_End_Nov2024.pdf"
}
