{
  "filename": "AdmitCard_BSc-BEd_Sept2024.txt",
  "content": {
    "institute": "National Institute of Technology Agartala",
    "address": "Barjala, Jirania, Agartala — 799046 (Tripura)",
    "office": "Office of the Dean Academic & Examinations",
    "contact_email": "exam.nitagartala@gmail.com",
    "reference_no": "No.F.NITA.6(1- Exam) / NOTICE/ 2016-17",
    "date": "18th September 2024",
    "notice": "This is to inform all students of the 3rd Semester B.Sc-B.Ed program appearing for the Mid Term Odd Semester Examination scheduled from 23rd September 2024, that the Admit Card for the said Examination can be printed from their respective MIS Accounts as per the schedule mentioned below.",
    "exam_details": [
      {
        "sl_no": 1,
        "exam_name": "Mid Term Odd Semester Examination (3rd Semester B.Sc-B.Ed)",
        "exam_starting_date": "23rd September 2024",
        "admit_card_download_duration": "20th September to 22nd September 2024"
      }
    ],
    "instructions": [
      "No student will be able to print their Admit Card before or after the above-mentioned schedule.",
      "All students are hereby instructed to bring the Admit Card to the Examination Hall while appearing for the examination and obtain the endorsement from the invigilator at the designated place.",
      "Any student who fails to bring the Admit Card each day of the examination to the Exam Hall will be required to bring a duplicate admit card for the remaining days, which can also be downloaded from their respective MIS Account against a fine of Rs. 200/-.",
      "Students without their Admit Card will be debarred from appearing in the Examinations."
    ],
    "signatory": {
      "name": "Associate Dean (Examinations)"
    },
    "copy_to": [
      "Dean (Academics) for kind information.",
      "All HoDs for kind information and necessary action, please.",
      "MIS In-Charge for kind information and necessary action, please.",
      "The System Administrator, NIT Agartala. He is requested to upload the Notification to the Institute Website.",
      "Guard file for record."
    ]
  },
  "source_url": "https://nita.ac.in/Student_Notifications/Examination/AdmitCard_BSc-BEd_Sept2024.pdf"
}
