{
  "filename": "Advt_AuditOfficer_Feb2025.txt",
  "content": {
    "institute": "National Institute of Technology Agartala",
    "location": "AGARTALA - 799046 (Tripura)",
    "ref_no": "F.NITA.2(166-Estt)/Cont// 2023/EDL6-26",
    "date": "1%/02/2025",
    "post": {
      "name": "Audit Officer (contractual)",
      "number_of_posts": 1,
      "maximum_age": "Up to 62 years as on 31-12-2024",
      "monthly_remuneration": "Rs. 50,000/- per month (consolidated). Remuneration will not be a constraint for deserving candidates. TA/DA admissible as per rules for official tour/visit",
      "place_of_posting": "NIT Agartala",
      "job_profile": [
        "Audit, review, and evaluate the internal control system of the institute and assess adequacy and effectiveness",
        "Perform tasks, consolidate results, and monitor/coordinate with auditors",
        "Assist institute in improvement of internal controls and review of financial/administrative procedures",
        "Assist authorities in interpretation of service rules, CCS rules, and institute rules",
        "Ensure compliance with GFR and other applicable rules & regulations",
        "Inspect, examine, and pre-audit bills before submission to Finance and Accounts Section",
        "Oversee pre, internal, statutory, and C&AG audit and ensure compliance with guidelines",
        "Assist authorities in preparing replies to audit para",
        "Any responsibility assigned by the Institute authority"
      ],
      "contract_tenure": "Initially one year, may extend up to 3 terms based on requirement and satisfactory performance. Total duration including renewals limited to 3 years",
      "qualification": {
        "essential": "Graduate in any discipline; previous similar experience preferred. Retired Group-A Audit Officer preferred",
        "desirable": "Knowledge of statutory compliance, auditing techniques, internal audit standards issued by ICAI, IIA Certification, CIA, ICAI Certificate on Internal Audit"
      },
      "experience": "Analogous post in Level-10 for 5 years or Level-9 for 7 years in Audit wing of educational institution of national importance funded by Govt. of India/State Govt/Autonomous bodies/PSU/Universities"
    },
    "application_instructions": {
      "documents_required": [
        "Post applied for",
        "Name (Block letters)",
        "Father’s/Husband’s Name",
        "Present & Permanent Address",
        "Date of Birth and Age as on 31-12-2024",
        "Email address and Mobile No.",
        "Category (SC/ST/OBC/PH/Ex-S)",
        "Educational qualification",
        "Experience (if any)",
        "Other information (if any)",
        "Agreement to terms & conditions (YES/NO)"
      ],
      "submission": "Self-attested photocopies of all certificates in a single PDF by 25-02-2025 via email at establishment@nita.ac.in",
      "interview_details": {
        "shortlisted_candidates_notification": "By return email with tentative date & time",
        "documents_to_bring": "Filled application form, passport-size photograph, original documents with self-attested copies"
      },
      "website_updates": "http://www.nita.ac.in"
    },
    "terms_conditions": [
      "Appointment purely on contract basis, fixed pay, initially one year, extendable up to 3 terms, total max 3 years",
      "Decision of Competent Authority final & binding",
      "One month notice or pay in lieu required for leaving during contract",
      "Engagement can be discontinued without reason; does not confer right of continuation",
      "Essential qualification must be from recognized University/Institute/Council",
      "Competent Authority may relax/modify eligibility criteria if candidate otherwise suitable",
      "Canvassing or outside influence liable for rejection",
      "No TA/DA for interview",
      "Superannuated employees of Central/State Govt./PSU encouraged to apply",
      "Experience means relevant experience after obtaining minimum educational qualification; experience certificate required",
      "In case of dispute, Director's decision is final & binding"
    ],
    "issued_by": "Col. (Dr) Ashish Badola, Registrar, NIT Agartala",
    "copy_to": [
      "PS to Director, NITA",
      "Director, Tripura Campus, NFSU, Agartala",
      "Registrar, Tripura University, Suryamaninagar, Amtali, West Tripura",
      "Registrar, Central Sanskrit University, Lembucherra, Tripura, Agartala",
      "Registrar, MBB University, College Tilla, Agartala",
      "Registrar, ICFAI University, Kamalghat, Agartala",
      "Chairman, Computing & ICT, NIT Agartala"
    ],
    "contact": {
      "tel": "+91 381 2546630 / 6629",
      "fax": "+91 381 2346360",
      "url": "www.nita.ac.in"
    }
  },
  "source_url": "https://nita.ac.in/Notice/Advt_AuditOfficer_Feb2025.pdf"
}
