{
  "filename": "Advt_FacilityManager_Feb2025.txt",
  "content": {
    "institute": "National Institute of Technology Agartala",
    "location": "AGARTALA - 799046 (Tripura)",
    "ref_no": "No.F.NITA.2(166-Estt)/Cont//2023/",
    "post": {
      "name": "Facility Manager (contractual)",
      "number_of_posts": 1,
      "maximum_age": "Up to 62 years as on 31-12-2024",
      "monthly_remuneration": "Rs. 50,000/- per month (consolidated). Remuneration will not be a constraint for deserving candidate. TA/DA admissible as per rules for official tour/visit",
      "job_profile": [
        "Management/Supervision of maintenance, gardening, housekeeping team to the required standard, ensuring maximum productivity, efficiency, and quality service while adhering to budget and compliance standards",
        "Supervise day-to-day maintenance of all aspects of the estate including buildings, tree cutting, horticulture, housekeeping, waste management, etc.",
        "Supervise utility staff and empanelled vendors"
      ],
      "contract_tenure": "Initially one year, may extend up to 3 terms, total duration including renewals limited to 3 years",
      "qualification": {
        "essential": "Graduate from a recognized University in any discipline",
        "desirable": "Experience relevant to job profile, preference for candidates from educational institutes, retired persons from Govt./Autonomous/PSU/Central/State University with required experience"
      }
    },
    "application_instructions": {
      "submission": "Application addressed to the Registrar, NIT Agartala with details (Post applied for, Name, Father/Husband's Name, Present & Permanent address, Date of birth & Age, Email, Mobile, Category, Educational Qualification, Experience, Other Info, Agreement to terms YES/NO), along with self-attested certificates in a single PDF via email at establishment@nita.ac.in by 25-02-2025",
      "interview": "Shortlisted candidates will be informed via email. They must bring filled-in application, passport-size photograph, originals and self-attested copies of certificates for verification"
    },
    "terms_conditions": [
      "Appointment purely on contract basis on fixed pay, initially one year, extendable up to 3 terms, total duration 3 years",
      "Decision of Competent Authority is final & binding",
      "One month notice or pay in lieu required for leaving during contract",
      "Engagement may be discontinued at any time; does not confer right of continuation",
      "Essential qualifications from recognized University/Institute/Council",
      "Competent Authority may relax/modify eligibility criteria if candidate otherwise suitable",
      "Canvassing or outside influence liable for rejection",
      "No TA/DA for interview",
      "Superannuated employees of Central Govt./State Govt./PSU encouraged to apply",
      "Experience means relevant experience acquired after minimum educational qualification; experience certificate from employer required",
      "In case of dispute, Director's decision is final & binding"
    ],
    "issued_by": "Col. (Dr) Ashish Badola, Registrar, NIT Agartala",
    "copy_to": [
      "PS to Director, NITA",
      "Director, Tripura Campus, NFSU, Agartala",
      "Registrar, Tripura University, Suryamaninagar, Amtali, West Tripura",
      "Registrar, Central Sanskrit University, Lembucherra, Tripura, Agartala",
      "Registrar, MBB University, College Tilla, Agartala",
      "Registrar, ICFAI University, Kamalghat, Agartala",
      "Chairman, Computing & ICT, NIT Agartala"
    ],
    "contact": {
      "tel": "+91 381 2546630 / 6629",
      "fax": "+91 381 2346360",
      "url": "www.nita.ac.in"
    }
  },
  "source_url": "https://nita.ac.in/Notice/Advt_FacilityManager_Feb2025.pdf"
}
