{
  "filename": "Advt_JrAssttTrainee_Feb2025.txt",
  "content": {
    "institute": "National Institute of Technology Agartala",
    "location": "AGARTALA - 799046 (Tripura)",
    "ref_no": "F.NITA.2(166-Estt)/Cont/2023/60",
    "post": {
      "name": "Junior Assistant Trainee (Fixed Period Intern)",
      "number_of_posts": 2,
      "maximum_age": "27 years for trainees as on 31-12-2024, up to 62 years for retired persons as on 31-12-2024",
      "monthly_stipend": "Rs. 20,000/- per month (consolidated). Remuneration may be considered for deserving candidates",
      "place_of_posting": "NIT Agartala",
      "contract_tenure": "Initially one year, may extend up to 2 years subject to institute requirements and satisfactory performance. Original term and extension together limited to 3 years. TA/DA admissible as per rules for official tour/visit",
      "qualification": {
        "essential": "Graduate in any discipline from a recognized University/Board",
        "desirable": "English proficiency in speaking & writing"
      },
      "experience": "At least 5 years experience in analogous post for retired persons from Central/State Govt./Autonomous bodies/PSU/Central/State University. Retired persons with similar work preferred"
    },
    "application_instructions": {
      "submission": "Application on plain paper addressed to the Registrar, NIT Agartala, mentioning Post, Name, Father/Husband's Name, Present & Permanent address, Date of birth & Age, Email, Mobile, Category, Educational qualification, Experience, Other info, Agreement to terms (YES/NO), along with self-attested certificates in single PDF via email at establishment@nitga.ac.in by 25-02-2025",
      "interview": "Shortlisted candidates informed via email. Must bring filled-in application, passport-size photograph, all original documents, and self-attested copies for verification"
    },
    "terms_conditions": [
      "Appointment purely on contract basis on fixed pay, initially one year, extendable up to 3 terms, total duration 3 years",
      "Decision of Competent Authority is final & binding",
      "One month notice or pay in lieu required for leaving during contract",
      "Engagement may be discontinued at any time; does not confer right of continuation",
      "Essential qualifications from recognized University/Institute/Council",
      "Competent Authority may relax/modify eligibility criteria if candidate otherwise suitable",
      "Canvassing or outside influence liable for rejection",
      "No TA/DA for interview",
      "Superannuated employees of Central Govt./State Govt./PSU encouraged to apply",
      "Experience means relevant experience acquired after minimum educational qualification; experience certificate from employer required",
      "In case of dispute, Director's decision is final & binding"
    ],
    "issued_by": "Col. (Dr.) Ashish Badola, Registrar, NIT Agartala",
    "copy_to": [
      "PS to Director, NITA",
      "Director, Tripura Campus, NFSU, Agartala",
      "Registrar, Tripura University, Suryamaninagar, Amtali, West Tripura",
      "Registrar, Central Sanskrit University, Lembucherra, Tripura, Agartala",
      "Registrar, MBB University, College Tilla, Agartala",
      "Registrar, ICFAI University, Kamalghat, Agartala",
      "Chairman, Computing & ICT, NIT Agartala"
    ],
    "contact": {
      "tel": "+91 381 2546630 / 6629",
      "fax": "+91 381 2346360",
      "url": "www.nita.ac.in"
    }
  },
  "source_url": "https://nita.ac.in/Notice/Advt_JrAssttTrainee_Feb2025.pdf"
}
